
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТекущуюПозициюРегистра(Организация) Экспорт
	
	ТекущаяПозиция = '00010101';
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонецПериода(ПозицииЗакрытияПериодаСрезПоследних.ГраницаПериода, День) КАК ГраницаПериода
	|ИЗ
	|	РегистрСведений.ПозицииЗакрытияПериода.СрезПоследних(, Организация = &Организация) КАК
	|		ПозицииЗакрытияПериодаСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		 Выборка = Результат.Выбрать();
		 Выборка.Следующий();
		 ТекущаяПозиция = Выборка.ГраницаПериода;
	КонецЕсли;
		
	Возврат	ТекущаяПозиция;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
